///////////////////////////////////////////////////////////////////////////////////////////////////////
// (с) Tolkachev Pavel, 2020 - 2022
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//    http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет тест модуля в список тестов.
//
// Параметры:
//  СписокТестов - Массив - список тестов, в который будет добавлен тест модуля.
//  ИмяТеста - Строка - имя тестовой процедуры, которая будет вызвана.
//  Параметры - Произвольный - дополнительные параметры, которые будут переданы тестовой процедуре.
//  Уточнение - Строка - используется для дополнительной группировки тестов с параметрами. Если используются параметры,
//                       то рекомендуется указывать пояснение по этим параметрам.
//
Процедура ДобавитьТестВСписок(СписокТестов, ИмяТеста, Параметры = Неопределено, Уточнение = "") Экспорт
	
	ОписаниеТеста = Новый Структура;
	ОписаниеТеста.Вставить("ИмяТеста", ИмяТеста);
	ОписаниеТеста.Вставить("Параметры", Параметры);
	ОписаниеТеста.Вставить("Уточнение", Уточнение);
	
	СписокТестов.Добавить(ОписаниеТеста);
	
КонецПроцедуры 

#КонецОбласти