///////////////////////////////////////////////////////////////////////////////////////////////////////
// (с) Tolkachev Pavel, 2020 - 2022
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//    http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает домашний каталог модуля тестирования.
// 
// Возвращаемое значение:
//  Строка
//
Функция КаталогМодуляТестирования() Экспорт
	
	Возврат КаталогДокументов() + "1cunit\";
	
КонецФункции 

Функция ПутьКФайлуРезультатовТестов(КаталогРезультатов) Экспорт
	
	Возврат КаталогРезультатов + ?(Прав(КаталогРезультатов, 1) <> "\", "\", "") + "1cunit_log.json";
	
КонецФункции 

// Возвращает значения настроек тестирования по умолчанию.
// 
// Возвращаемое значение:
//  Структура - настройки тестирования по умолчанию.
//
Функция НастройкиТестированияПоУмолчанию() Экспорт
	
	НастройкиТестирования = Новый Структура;
	НастройкиТестирования.Вставить("СохранятьРезультаты", Истина);
	НастройкиТестирования.Вставить("КаталогЖурнала", КаталогМодуляТестирования());
	НастройкиТестирования.Вставить("АвтоматическийЗапускПриНачалеРаботы", Ложь);
	НастройкиТестирования.Вставить("ПользовательДляАвтоЗапускаТестов", "");
	НастройкиТестирования.Вставить("ЗавершатьРаботуПослеАвтозапуска", Ложь);
	НастройкиТестирования.Вставить("АдресПубликацииИБ", "");
	НастройкиТестирования.Вставить("ИмяПользователяИБ", "");
	НастройкиТестирования.Вставить("ПарольПользователяИБ", "");
	
	Возврат НастройкиТестирования;
	
КонецФункции

#КонецОбласти 